Revit 2024 API
DockablePaneProviderData Class
 Information about a new dockable pane being added to the Revit user interface.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class DockablePaneProviderData
Visual Basic
Public Class DockablePaneProviderData
Visual C++
public ref class DockablePaneProviderData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.DockablePaneProviderData
See Also
DockablePaneProviderData Members
Autodesk.Revit.UI Namespace